tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1707_tdd.h
#define IOCBF6                        522
#define IOCBF7                        523
#define IOCCP                         524
#define IOCCP0                        525
#define IOCCP1                        526
#define IOCCP2                        527
#define IOCCP3                        528
#define IOCCP4                        529
#define IOCCP5                        530
#define IOCCP6                        531
#define IOCCP7                        532
#define IOCCN                         533
#define IOCCN0                        534
#define IOCCN1                        535
#define IOCCN2                        536
#define IOCCN3                        537
#define IOCCN4                        538
#define IOCCN5                        539
#define IOCCN6                        540
#define IOCCN7                        541
#define IOCCF                         542
#define IOCCF0                        543
#define IOCCF1                        544
#define IOCCF2                        545
#define IOCCF3                        546
#define IOCCF4                        547
#define IOCCF5                        548
#define IOCCF6                        549
#define IOCCF7                        550
#define OPA1CON                       551
#define OPA1PCH                       552
#define OPA1PCH0                      553
#define OPA1PCH1                      554
#define OPA1UG                        555
#define OPA1SP                        556
#define OPA1EN                        557
#define OPA2CON                       558
#define OPA2PCH                       559
#define OPA2PCH0                      560
#define OPA2PCH1                      561
#define OPA2UG                        562
#define OPA2SP                        563
#define OPA2EN                        564
#define PPSLOCK                       565
#define PPSLOCKED                     566
#define INTPPS                        567
#define T0CKIPPS                      568
#define T1CKIPPS                      569
#define T1GPPS                        570
#define CCP1PPS                       571
#define CCP2PPS                       572
#define SSPCLKPPS                     573
#define SSPDATPPS                     574
#define SSPSSPPS                      575
#define RA0PPS                        576
#define RA1PPS                        577
#define RA2PPS                        578
#define RA4PPS                        579
#define RA5PPS                        580
#define RB4PPS                        581
#define RB5PPS                        582
#define RB6PPS                        583
#define RB7PPS                        584
#define RC0PPS                        585
#define RC1PPS                        586
#define RC2PPS                        587
#define RC3PPS                        588
#define RC4PPS                        589
#define RC5PPS                        590
#define RC6PPS                        591
#define RC7PPS                        592
#define ICDBK0H                       593
#define BKA8                          594
#define BKA9                          595
#define BKA10                         596
#define BKA11                         597
#define BKA12                         598
#define BKA13                         599
#define BKA14                         600
#define STATUS_SHAD                   601
#define C_SHAD                        602
#define DC_SHAD                       603
#define Z_SHAD                        604
#define WREG_SHAD                     605
#define BSR_SHAD                      606
#define PCLATH_SHAD                   607
#define FSR0L_SHAD                    608
#define FSR0H_SHAD                    609
#define FSR1L_SHAD                    610
#define FSR1H_SHAD                    611
#define STKPTR                        612
#define TOSL                          613
#define TOSH                          614

#endif // _PIC16F1707_H_
